[
  {
    "id": 1,
    "title": "DÉSOLATION",
    "category": "3D",
    "course": "Animation 3D | Audio 2 | Traitement Audiovisuel",
    "type": "Individuel",
    "team": "Elie Daher",
    "shortDesc": "J'ai créé une expérience qui exprime la désolation à travers des sons et des animations abstraites, en jouant sur le vide, la confusion et la perte.",
    "longDesc": "Le projet demandait de créer une expérience interactive à partir d'une caméra et d'un microphone. J'ai produit une scène qui réagit en temps réel avec un rendu 3D, des effets visuels dans TouchDesigner et des sons que j'ai synthétisés dans Reaper et MAX. Le but était de plonger la personne dans une ambiance instable et troublante qui fait ressentir la désolation.",
    "images": [
      "./assets/images/img_desolation_01.png",
      "./assets/images/img_desolation_02.png",
      "./assets/images/img_desolation_03.png",
      "./assets/images/img_desolation_04.png"
    ],
    "link": "https://youtu.be/rM1qbGPscNA",
    "role": "Animateur, Compositeur, Designer",
    "software": "Maya, Touch Designer, MAX, DaVinci"
  },

  {
    "id": 2,
    "title": "ARSENAL",
    "category": "3D",
    "course": "Modélisation 3D",
    "type": "Équipe",
    "team": "Elie Daher, Émeryk Bélisle, Mohammed Amine Boussetta",
    "shortDesc": "J'ai participé à la création d'une scène 3D en équipe dans Maya, représentant un arsenal abandonné en style low poly pour combiner simplicité et ambiance visuelle forte.",
    "longDesc": "Le projet demandait de concevoir une scène 3D abstraite ou stylisée en équipe. Nous avons choisi de représenter un arsenal abandonné envahi par la végétation, en travaillant sur l'éclairage et la composition pour transmettre une impression d'abandon et de mystère. Chaque membre devait modéliser au moins trois objets 3D avant de les intégrer à la scène finale, qui a été ajustée jusqu'à obtenir un rendu cohérent et atmosphérique.",
    "images": ["./assets/images/img_arsenal_01.png"],
    "processImages": [
      "./assets/images/img_arsenal_process_01.png",
      "./assets/images/img_arsenal_process_02.png",
      "./assets/images/img_arsenal_process_03.png",
      "./assets/images/img_arsenal_process_04.png",
      "./assets/images/img_arsenal_process_05.png",
      "./assets/images/img_arsenal_process_06.png",
      "./assets/images/img_arsenal_process_07.png",
      "./assets/images/img_arsenal_process_08.png",
      "./assets/images/img_arsenal_process_09.png",
      "./assets/images/img_arsenal_process_10.png"
    ],
    "processDescription01": "On devait créer un décor abstrait ou stylisé dans Maya. On a choisi un style low poly et décidé de représenter un arsenal abandonné pour garder un rendu simple mais esthétique.",
    "processDescription02": "On a commencé par réaliser un moodboard pour définir les couleurs, la lumière et l'atmosphère générale de la scène.",
    "processDescription03": "Ensuite, on a fait un concept visuel du décor afin de planifier l'espace, le cadrage et la disposition des éléments dans la scène 3D.",
    "processDescription04": "Chaque membre de l'équipe devait modéliser trois objets. J'ai créé une chaise, un coffre et une potion, en suivant le style low poly défini ensemble. Une fois les objets modélisés, on les a rendus dans Maya pour s'assurer qu'ils s'intégraient bien visuellement et respectaient le style global du décor. De plus nous avons chacun fait trois autres objets pour enrichir plus l'intérieur de notre scène. Voici mes 6 objets modélisés:",
    "processDescription05": "Après l'assemblage initial, on a réalisé une première version de la scène. Elle paraissait trop propre et trop lumineuse, donc on devait ajuster les lianes, le plancher at ajouter plus de la nature qui envahit l'arsenal.",
    "processDescription06": "Dans la deuxième version, on a retravaillé l'éclairage et corrigé les éléments du sol qui flottaient. On voulait que la lumière venant de la fenêtre soit plus marquée.",
    "processDescription07": "Pour la version finale, on a réduit la lumière des lampes et accentué celle de la fenêtre pour créer un effet dramatique. On a aussi ajouté une potion renversée éclairée par la lumière.",
    "processDescription08": "On a fait plusieurs rendus finaux sous différents angles, dont un gros plan sur la potion, pour bien montrer les détails et l'ambiance générale de la scène.",
    "finalImages": [
      "./assets/images/img_arsenal_final_01.png",
      "./assets/images/img_arsenal_final_02.png",
      "./assets/images/img_arsenal_final_03.png",
      "./assets/images/img_arsenal_final_04.png"
    ],
    "link": "./assets/doc/Arsenal_Daher_Boussetta_Belisle.pdf",
    "role": "Modélisateur",
    "software": "Maya, Photoshop"
  },

  {
    "id": 3,
    "title": "POWBALL",
    "category": "JEUX",
    "course": "Realité Mixte",
    "type": "Équipe",
    "team": "Elie Daher, Émeryk Bélisle",
    "shortDesc": "J'ai créé une expérience VR où le joueur doit survivre dans un laboratoire pendant un temps limité en évitant des balles et en utilisant les bonus et l'environnement à son avantage.",
    "longDesc": "Le projet consiste à produire une expérience de réalité virtuelle inspirée d'un jeu rétro pour casque Oculus. Le joueur incarne un sujet de test dans un laboratoire où il doit éviter des balles aux comportements variés pendant une durée déterminée. Les balles rebondissent sur les murs et possèdent chacune des propriétés spécifiques, certaines se divisant ou changeant de vitesse après un impact. Un second joueur, connecté via TouchDesigner, peut interagir avec l'environnement en ajoutant des obstacles ou en modifiant la structure de la salle. L'expérience mélange survie, stratégie et chaos contrôlé jusqu'à la fin du chronomètre.",
    "images": [
      "./assets/images/img_powball_01.png",
      "./assets/images/img_powball_02.png",
      "./assets/images/img_powball_03.png",
      "./assets/images/img_powball_04.png"
    ],
    "link": "https://www.youtube.com/watch?v=1T_U1eIJfLM",
    "role": "Modélisateur, Game Designer, Concepteur Sonore",
    "software": "Unity, Reaper, Touch Designer"
  },

  {
    "id": 4,
    "title": "THE LOST FRIEND",
    "category": "JEUX",
    "course": "Interactivité ludique",
    "type": "Individuel",
    "team": "Elie Daher",
    "shortDesc": "Je devais démontrer une réalisation d'une expérience ludique avec un sens de progression en intégrant images et sons avec Phaser.",
    "longDesc": "The Lost Friend est un jeu d'aventure en 2D où le joueur incarne un héros qui doit sauver son ami capturé. Pour y arriver, il doit explorer différents niveaux, combattre des ennemis et collecter des diamants servant à négocier avec le boss ennemi. Inspiré de jeux comme Ori and the Will of the Wisps et Hollow Knight, le jeu mélange exploration, combat et narration pour créer une expérience à la fois simple et immersive. Chaque niveau demande de ramasser tous les diamants pour progresser, et les dialogues intégrés aident à comprendre l'histoire et les objectifs.",
    "images": [
      "./assets/images/img_thelostfriend_01.png",
      "./assets/images/img_thelostfriend_02.png",
      "./assets/images/img_thelostfriend_03.png",
      "./assets/images/img_thelostfriend_04.png"
    ],
    "link": "https://edhr07.itch.io/the-lost-friend",
    "role": "Programmeur, Concepteur de niveau, Concepteur artistique, Concepteur audio",
    "software": "Phaser, Tiled, Photoshop, Figma"
  },

  {
    "id": 5,
    "title": "EML",
    "category": "WEB",
    "course": "Web 4",
    "type": "Équipe",
    "team": "Elie Daher, Émeryk Bélisle",
    "shortDesc": "J'ai co-créé le site EML, un magazine web sur les jeux vidéo développé avec WordPress. Le projet visait à appliquer toutes les notions apprises en cours en réalisant un site complet avec une structure dynamique, un design personnalisé et une gestion de contenu claire.",
    "longDesc": "EML est un site de type magazine conçu avec le CMS WordPress. Le projet avait pour but de créer une plateforme complète en appliquant les notions apprises, comme la personnalisation du thème, la gestion de la base de données et l'organisation du contenu dynamique. Le site comprend plusieurs pages : une page d'accueil avec les articles récents, une page d'auteurs, une barre de recherche et une page d'erreur 404 personnalisée. Le contenu est géré à partir du tableau de bord WordPress, ce qui permet d'ajouter facilement de nouvelles critiques, guides, classements (top 10) et autres articles. Nous avons créé un site clair et réactif, traduit en français et en anglais, avec un thème qui reflète notre style et présente nos textes de manière simple et bien structurée.",
    "images": [
      "./assets/images/img_eml_01.png",
      "./assets/images/img_eml_02.png",
      "./assets/images/img_eml_03.png",
      "./assets/images/img_eml_04.png"
    ],
    "link": "https://emerykbelisle.bennerwebs.com/eml/",
    "role": "Développeur web, Designer",
    "software": "WordPress, Figma, VS Code"
  }
]
